In [1]:
import numpy as np
x = np.array([1, 2, 3, 4, 5, 6])
x * 2

array([ 2,  4,  6,  8, 10, 12])

In [2]:
data = ['a', 'b', 'c', 'd']
[s.capitalize() for s in data]

['A', 'B', 'C', 'D']

In [3]:
data = ['peter', 'willie', None, 'Annie', 'John']
[s.capitalize() for s in data]

AttributeError: 'NoneType' object has no attribute 'capitalize'

In [4]:
import pandas as pd
names = pd.Series(data)
names

0     peter
1    willie
2      None
3     Annie
4      John
dtype: object

In [5]:
names.str.capitalize()

0     Peter
1    Willie
2      None
3     Annie
4      John
dtype: object

In [6]:
monte = pd.Series(['Willie Hung', 'John Wick', 'Conor Mcgregor'])
monte.str.lower()

0       willie hung
1         john wick
2    conor mcgregor
dtype: object

In [7]:
monte.str.len()

0    11
1     9
2    14
dtype: int64

In [8]:
monte.str.startswith('T')

0    False
1    False
2    False
dtype: bool

In [9]:
monte.str.split()

0       [Willie, Hung]
1         [John, Wick]
2    [Conor, Mcgregor]
dtype: object

In [10]:
monte.str.extract('([A-Za-z]+)', expand=False)

0    Willie
1      John
2     Conor
dtype: object

In [11]:
monte.str.findall(r'^[^AEIOU].*[^aeiou]$')

0       [Willie Hung]
1         [John Wick]
2    [Conor Mcgregor]
dtype: object

In [12]:
monte.str[0:3]

0    Wil
1    Joh
2    Con
dtype: object

In [13]:
monte.str.split().str.get(-1)

0        Hung
1        Wick
2    Mcgregor
dtype: object

In [15]:
full_monte = pd.DataFrame({'name': monte,
                           'info': ['a', 'b', 'c']})
full_monte

             name info
0     Willie Hung    a
1       John Wick    b
2  Conor Mcgregor    c

In [16]:
full_monte['info'].str.get_dummies('|')

   a  b  c
0  1  0  0
1  0  1  0
2  0  0  1